# 4. Создать переменные john_gender и marta_gender булевого типа. Пусть john будет принимать истинное значение а marta
# ложное. Вывести в консоль методом print значения обеих переменных.

john_gender = True
marta_gender = False
print(john_gender, marta_gender)
