# 7. Создайте 2 переменные типа кортеж. Кортеж должен состоять из 2 чисел с плавающей точкой.
# Первое значение кортежа это широта в которой вы проживаете, а второе это долгота в которой вы проживаете.

a = (50.4851493, 30.4721233)
b = (50.4851593, 30.4725233)
print(a, b)
# Good but you should clarify requirements if they are not clear with lead.
