# 2. Создать переменные john_age и marta_age целочисленного типа. Присвоить созданным переменным значения по своему
# усмотрению. Вывести в консоль методом print значения обеих переменных.

john_age = 22
marta_age = 33
print(john_age, marta_age)