# 5. Создать переменные john_friends и marta_friends. Присвоить переменным списки. Каждый список должен содержать имена
# дружей. У джона свой список друзей а у Марты свой. Друзья (имя друга) могут быть обычные строки “James”, “Peter”
# и т. Д.

john_friends = ["Alex", "Harry", "Ivan"]
marta_friends = ["Hanna", "Rio", "Viki"]
print(john_friends, marta_friends)
