# 1. Создать переменные john_salary и marta_salary вещественного типа (с плавающей точкой).
# Присвоить созданным переменным значения по своему усмотрению. Вывести в консоль методом print значения
# обеих переменных.

john_salary = 5000.50
marta_salary = 6000.60
print(john_salary, marta_salary)
