# 3. Создать переменные john_name и marta_name строкового типа. Присвоить созданным переменным значения по своему
# усмотрению. Вывести в консоль методом print значения обеих переменных.

john_name = "John"
marta_name = "Marta"
print(john_name, marta_name)
